MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4500-F144K1024/mcu.h
/* --------------------------------  EBU_BUSRCON2  -------------------------------- */
#define EBU_BUSRCON2_FETBLEN_Pos              (0UL)                     /*!< EBU BUSRCON2: FETBLEN (Bit 0)                               */
#define EBU_BUSRCON2_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSRCON2: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRCON2_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSRCON2: FBBMSEL (Bit 3)                               */
#define EBU_BUSRCON2_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSRCON2: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON2_BFSSS_Pos                (4UL)                     /*!< EBU BUSRCON2: BFSSS (Bit 4)                                 */
#define EBU_BUSRCON2_BFSSS_Msk                (0x10UL)                  /*!< EBU BUSRCON2: BFSSS (Bitfield-Mask: 0x01)                   */
#define EBU_BUSRCON2_FDBKEN_Pos               (5UL)                     /*!< EBU BUSRCON2: FDBKEN (Bit 5)                                */
#define EBU_BUSRCON2_FDBKEN_Msk               (0x20UL)                  /*!< EBU BUSRCON2: FDBKEN (Bitfield-Mask: 0x01)                  */
#define EBU_BUSRCON2_BFCMSEL_Pos              (6UL)                     /*!< EBU BUSRCON2: BFCMSEL (Bit 6)                               */
#define EBU_BUSRCON2_BFCMSEL_Msk              (0x40UL)                  /*!< EBU BUSRCON2: BFCMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON2_NAA_Pos                  (7UL)                     /*!< EBU BUSRCON2: NAA (Bit 7)                                   */
#define EBU_BUSRCON2_NAA_Msk                  (0x80UL)                  /*!< EBU BUSRCON2: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON2_ECSE_Pos                 (16UL)                    /*!< EBU BUSRCON2: ECSE (Bit 16)                                 */
#define EBU_BUSRCON2_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSRCON2: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON2_EBSE_Pos                 (17UL)                    /*!< EBU BUSRCON2: EBSE (Bit 17)                                 */
#define EBU_BUSRCON2_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSRCON2: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON2_DBA_Pos                  (18UL)                    /*!< EBU BUSRCON2: DBA (Bit 18)                                  */
#define EBU_BUSRCON2_DBA_Msk                  (0x40000UL)               /*!< EBU BUSRCON2: DBA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON2_WAITINV_Pos              (19UL)                    /*!< EBU BUSRCON2: WAITINV (Bit 19)                              */
#define EBU_BUSRCON2_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSRCON2: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON2_BCGEN_Pos                (20UL)                    /*!< EBU BUSRCON2: BCGEN (Bit 20)                                */
#define EBU_BUSRCON2_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSRCON2: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON2_PORTW_Pos                (22UL)                    /*!< EBU BUSRCON2: PORTW (Bit 22)                                */
#define EBU_BUSRCON2_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSRCON2: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON2_WAIT_Pos                 (24UL)                    /*!< EBU BUSRCON2: WAIT (Bit 24)                                 */
#define EBU_BUSRCON2_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSRCON2: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSRCON2_AAP_Pos                  (26UL)                    /*!< EBU BUSRCON2: AAP (Bit 26)                                  */
#define EBU_BUSRCON2_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSRCON2: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON2_AGEN_Pos                 (28UL)                    /*!< EBU BUSRCON2: AGEN (Bit 28)                                 */
#define EBU_BUSRCON2_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSRCON2: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSRAP2  -------------------------------- */
#define EBU_BUSRAP2_RDDTACS_Pos               (0UL)                     /*!< EBU BUSRAP2: RDDTACS (Bit 0)                                */
#define EBU_BUSRAP2_RDDTACS_Msk               (0xfUL)                   /*!< EBU BUSRAP2: RDDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSRAP2_RDRECOVC_Pos              (4UL)                     /*!< EBU BUSRAP2: RDRECOVC (Bit 4)                               */
#define EBU_BUSRAP2_RDRECOVC_Msk              (0x70UL)                  /*!< EBU BUSRAP2: RDRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRAP2_WAITRDC_Pos               (7UL)                     /*!< EBU BUSRAP2: WAITRDC (Bit 7)                                */
#define EBU_BUSRAP2_WAITRDC_Msk               (0xf80UL)                 /*!< EBU BUSRAP2: WAITRDC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSRAP2_DATAC_Pos                 (12UL)                    /*!< EBU BUSRAP2: DATAC (Bit 12)                                 */
#define EBU_BUSRAP2_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSRAP2: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSRAP2_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSRAP2: EXTCLOCK (Bit 16)                              */
#define EBU_BUSRAP2_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSRAP2: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSRAP2_EXTDATA_Pos               (18UL)                    /*!< EBU BUSRAP2: EXTDATA (Bit 18)                               */
#define EBU_BUSRAP2_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSRAP2: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSRAP2_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSRAP2: CMDDELAY (Bit 20)                              */
#define EBU_BUSRAP2_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSRAP2: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSRAP2_AHOLDC_Pos                (24UL)                    /*!< EBU BUSRAP2: AHOLDC (Bit 24)                                */
#define EBU_BUSRAP2_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSRAP2: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSRAP2_ADDRC_Pos                 (28UL)                    /*!< EBU BUSRAP2: ADDRC (Bit 28)                                 */
#define EBU_BUSRAP2_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSRAP2: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSWCON2  -------------------------------- */
#define EBU_BUSWCON2_FETBLEN_Pos              (0UL)                     /*!< EBU BUSWCON2: FETBLEN (Bit 0)                               */
#define EBU_BUSWCON2_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSWCON2: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWCON2_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSWCON2: FBBMSEL (Bit 3)                               */
#define EBU_BUSWCON2_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSWCON2: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON2_NAA_Pos                  (7UL)                     /*!< EBU BUSWCON2: NAA (Bit 7)                                   */
#define EBU_BUSWCON2_NAA_Msk                  (0x80UL)                  /*!< EBU BUSWCON2: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON2_ECSE_Pos                 (16UL)                    /*!< EBU BUSWCON2: ECSE (Bit 16)                                 */
#define EBU_BUSWCON2_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSWCON2: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON2_EBSE_Pos                 (17UL)                    /*!< EBU BUSWCON2: EBSE (Bit 17)                                 */
#define EBU_BUSWCON2_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSWCON2: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON2_WAITINV_Pos              (19UL)                    /*!< EBU BUSWCON2: WAITINV (Bit 19)                              */
#define EBU_BUSWCON2_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSWCON2: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON2_BCGEN_Pos                (20UL)                    /*!< EBU BUSWCON2: BCGEN (Bit 20)                                */
#define EBU_BUSWCON2_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSWCON2: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON2_PORTW_Pos                (22UL)                    /*!< EBU BUSWCON2: PORTW (Bit 22)                                */
#define EBU_BUSWCON2_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSWCON2: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON2_WAIT_Pos                 (24UL)                    /*!< EBU BUSWCON2: WAIT (Bit 24)                                 */
#define EBU_BUSWCON2_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSWCON2: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSWCON2_AAP_Pos                  (26UL)                    /*!< EBU BUSWCON2: AAP (Bit 26)                                  */
#define EBU_BUSWCON2_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSWCON2: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON2_LOCKCS_Pos               (27UL)                    /*!< EBU BUSWCON2: LOCKCS (Bit 27)                               */
#define EBU_BUSWCON2_LOCKCS_Msk               (0x8000000UL)             /*!< EBU BUSWCON2: LOCKCS (Bitfield-Mask: 0x01)                  */
#define EBU_BUSWCON2_AGEN_Pos                 (28UL)                    /*!< EBU BUSWCON2: AGEN (Bit 28)                                 */
#define EBU_BUSWCON2_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSWCON2: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSWAP2  -------------------------------- */
#define EBU_BUSWAP2_WRDTACS_Pos               (0UL)                     /*!< EBU BUSWAP2: WRDTACS (Bit 0)                                */
#define EBU_BUSWAP2_WRDTACS_Msk               (0xfUL)                   /*!< EBU BUSWAP2: WRDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSWAP2_WRRECOVC_Pos              (4UL)                     /*!< EBU BUSWAP2: WRRECOVC (Bit 4)                               */
#define EBU_BUSWAP2_WRRECOVC_Msk              (0x70UL)                  /*!< EBU BUSWAP2: WRRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWAP2_WAITWRC_Pos               (7UL)                     /*!< EBU BUSWAP2: WAITWRC (Bit 7)                                */
#define EBU_BUSWAP2_WAITWRC_Msk               (0xf80UL)                 /*!< EBU BUSWAP2: WAITWRC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSWAP2_DATAC_Pos                 (12UL)                    /*!< EBU BUSWAP2: DATAC (Bit 12)                                 */
#define EBU_BUSWAP2_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSWAP2: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSWAP2_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSWAP2: EXTCLOCK (Bit 16)                              */
#define EBU_BUSWAP2_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSWAP2: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSWAP2_EXTDATA_Pos               (18UL)                    /*!< EBU BUSWAP2: EXTDATA (Bit 18)                               */
#define EBU_BUSWAP2_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSWAP2: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSWAP2_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSWAP2: CMDDELAY (Bit 20)                              */
#define EBU_BUSWAP2_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSWAP2: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSWAP2_AHOLDC_Pos                (24UL)                    /*!< EBU BUSWAP2: AHOLDC (Bit 24)                                */
#define EBU_BUSWAP2_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSWAP2: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSWAP2_ADDRC_Pos                 (28UL)                    /*!< EBU BUSWAP2: ADDRC (Bit 28)                                 */
#define EBU_BUSWAP2_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSWAP2: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSRCON3  -------------------------------- */
#define EBU_BUSRCON3_FETBLEN_Pos              (0UL)                     /*!< EBU BUSRCON3: FETBLEN (Bit 0)                               */
#define EBU_BUSRCON3_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSRCON3: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRCON3_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSRCON3: FBBMSEL (Bit 3)                               */
#define EBU_BUSRCON3_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSRCON3: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON3_BFSSS_Pos                (4UL)                     /*!< EBU BUSRCON3: BFSSS (Bit 4)                                 */
#define EBU_BUSRCON3_BFSSS_Msk                (0x10UL)                  /*!< EBU BUSRCON3: BFSSS (Bitfield-Mask: 0x01)                   */
#define EBU_BUSRCON3_FDBKEN_Pos               (5UL)                     /*!< EBU BUSRCON3: FDBKEN (Bit 5)                                */
#define EBU_BUSRCON3_FDBKEN_Msk               (0x20UL)                  /*!< EBU BUSRCON3: FDBKEN (Bitfield-Mask: 0x01)                  */
#define EBU_BUSRCON3_BFCMSEL_Pos              (6UL)                     /*!< EBU BUSRCON3: BFCMSEL (Bit 6)                               */
#define EBU_BUSRCON3_BFCMSEL_Msk              (0x40UL)                  /*!< EBU BUSRCON3: BFCMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON3_NAA_Pos                  (7UL)                     /*!< EBU BUSRCON3: NAA (Bit 7)                                   */
#define EBU_BUSRCON3_NAA_Msk                  (0x80UL)                  /*!< EBU BUSRCON3: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON3_ECSE_Pos                 (16UL)                    /*!< EBU BUSRCON3: ECSE (Bit 16)                                 */
#define EBU_BUSRCON3_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSRCON3: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON3_EBSE_Pos                 (17UL)                    /*!< EBU BUSRCON3: EBSE (Bit 17)                                 */
#define EBU_BUSRCON3_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSRCON3: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON3_DBA_Pos                  (18UL)                    /*!< EBU BUSRCON3: DBA (Bit 18)                                  */
#define EBU_BUSRCON3_DBA_Msk                  (0x40000UL)               /*!< EBU BUSRCON3: DBA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON3_WAITINV_Pos              (19UL)                    /*!< EBU BUSRCON3: WAITINV (Bit 19)                              */
#define EBU_BUSRCON3_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSRCON3: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON3_BCGEN_Pos                (20UL)                    /*!< EBU BUSRCON3: BCGEN (Bit 20)                                */
#define EBU_BUSRCON3_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSRCON3: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON3_PORTW_Pos                (22UL)                    /*!< EBU BUSRCON3: PORTW (Bit 22)                                */
#define EBU_BUSRCON3_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSRCON3: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON3_WAIT_Pos                 (24UL)                    /*!< EBU BUSRCON3: WAIT (Bit 24)                                 */
#define EBU_BUSRCON3_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSRCON3: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSRCON3_AAP_Pos                  (26UL)                    /*!< EBU BUSRCON3: AAP (Bit 26)                                  */
#define EBU_BUSRCON3_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSRCON3: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON3_AGEN_Pos                 (28UL)                    /*!< EBU BUSRCON3: AGEN (Bit 28)                                 */
#define EBU_BUSRCON3_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSRCON3: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSRAP3  -------------------------------- */
#define EBU_BUSRAP3_RDDTACS_Pos               (0UL)                     /*!< EBU BUSRAP3: RDDTACS (Bit 0)                                */
#define EBU_BUSRAP3_RDDTACS_Msk               (0xfUL)                   /*!< EBU BUSRAP3: RDDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSRAP3_RDRECOVC_Pos              (4UL)                     /*!< EBU BUSRAP3: RDRECOVC (Bit 4)                               */
#define EBU_BUSRAP3_RDRECOVC_Msk              (0x70UL)                  /*!< EBU BUSRAP3: RDRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRAP3_WAITRDC_Pos               (7UL)                     /*!< EBU BUSRAP3: WAITRDC (Bit 7)                                */
#define EBU_BUSRAP3_WAITRDC_Msk               (0xf80UL)                 /*!< EBU BUSRAP3: WAITRDC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSRAP3_DATAC_Pos                 (12UL)                    /*!< EBU BUSRAP3: DATAC (Bit 12)                                 */
#define EBU_BUSRAP3_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSRAP3: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSRAP3_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSRAP3: EXTCLOCK (Bit 16)                              */
#define EBU_BUSRAP3_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSRAP3: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSRAP3_EXTDATA_Pos               (18UL)                    /*!< EBU BUSRAP3: EXTDATA (Bit 18)                               */
#define EBU_BUSRAP3_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSRAP3: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSRAP3_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSRAP3: CMDDELAY (Bit 20)                              */
#define EBU_BUSRAP3_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSRAP3: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSRAP3_AHOLDC_Pos                (24UL)                    /*!< EBU BUSRAP3: AHOLDC (Bit 24)                                */
#define EBU_BUSRAP3_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSRAP3: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSRAP3_ADDRC_Pos                 (28UL)                    /*!< EBU BUSRAP3: ADDRC (Bit 28)                                 */
#define EBU_BUSRAP3_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSRAP3: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSWCON3  -------------------------------- */
#define EBU_BUSWCON3_FETBLEN_Pos              (0UL)                     /*!< EBU BUSWCON3: FETBLEN (Bit 0)                               */
#define EBU_BUSWCON3_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSWCON3: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWCON3_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSWCON3: FBBMSEL (Bit 3)                               */
#define EBU_BUSWCON3_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSWCON3: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON3_NAA_Pos                  (7UL)                     /*!< EBU BUSWCON3: NAA (Bit 7)                                   */
#define EBU_BUSWCON3_NAA_Msk                  (0x80UL)                  /*!< EBU BUSWCON3: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON3_ECSE_Pos                 (16UL)                    /*!< EBU BUSWCON3: ECSE (Bit 16)                                 */
#define EBU_BUSWCON3_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSWCON3: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON3_EBSE_Pos                 (17UL)                    /*!< EBU BUSWCON3: EBSE (Bit 17)                                 */
#define EBU_BUSWCON3_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSWCON3: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON3_WAITINV_Pos              (19UL)                    /*!< EBU BUSWCON3: WAITINV (Bit 19)                              */
#define EBU_BUSWCON3_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSWCON3: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON3_BCGEN_Pos                (20UL)                    /*!< EBU BUSWCON3: BCGEN (Bit 20)                                */
#define EBU_BUSWCON3_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSWCON3: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON3_PORTW_Pos                (22UL)                    /*!< EBU BUSWCON3: PORTW (Bit 22)                                */
#define EBU_BUSWCON3_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSWCON3: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON3_WAIT_Pos                 (24UL)                    /*!< EBU BUSWCON3: WAIT (Bit 24)                                 */
#define EBU_BUSWCON3_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSWCON3: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSWCON3_AAP_Pos                  (26UL)                    /*!< EBU BUSWCON3: AAP (Bit 26)                                  */
#define EBU_BUSWCON3_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSWCON3: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON3_LOCKCS_Pos               (27UL)                    /*!< EBU BUSWCON3: LOCKCS (Bit 27)                               */
#define EBU_BUSWCON3_LOCKCS_Msk               (0x8000000UL)             /*!< EBU BUSWCON3: LOCKCS (Bitfield-Mask: 0x01)                  */
#define EBU_BUSWCON3_AGEN_Pos                 (28UL)                    /*!< EBU BUSWCON3: AGEN (Bit 28)                                 */
#define EBU_BUSWCON3_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSWCON3: AGEN (Bitfield-Mask: 0x0f)                    */

